#+title: Doom Emacs Configuration
#+author: Jorge Vargas Silva.
#+description: A literate programming approach to my Doom Emacs configuration

* direnv integration

#+begin_src emacs-lisp
(use-package! envrc
  :hook (after-init . envrc-global-mode)  ; or just for prog-mode if you prefer
  :config
  (envrc-global-mode))
#+end_src

#+RESULTS:
| doom-init-fonts-h | doom-init-theme-h | envrc-global-mode | org-persist-load-all | ns-auto-titlebar-set-all-frames | tramp-register-archive-autoload-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |
